{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "darkv0rt3x", "content": "I jut started reading about this BIP and would like to see some discussion about it. Plenty of discussion already existis, but now, on a specific matter, a BIPhttps://x.com/ostrom72158/status/1997537240701112497https://github.com/ostromcode/The-CatI am for it.Rationale:RationaleThis BIP makes minimal changes to the consensus surface. It adds no new opcodes and does not expand Bitcoin\u0092s scripting language or programmability. Instead, it introduces a single new consensus concept: a binary classification that marks some existing UTXOs as permanently unspendable Non-Monetary UTXOs (NMUs). In that sense, it is closer to a one-time reclassification of a subset of UTXOs than an ongoing change to Bitcoin\u0092s programming model.External indexers, determinism, and reproducibilityInstead of re-implementing complex inscription and stamp classification rules in Bitcoin clients, this BIP relies on mature tools that are already used by the non-monetary data community, specifically Ord and Stamps. Exact versions of these indexers are specified and pinned by commit so that their behavior is deterministic. The NMU set is defined in terms of chain data as seen through these specified indexers, rather than as an arbitrary hard-coded list of UTXOs. This keeps the consensus rule grounded in chain-derived information while avoiding the need to embed inscription logic directly in Bitcoin client software.", "date": "Hero Member\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 1302\n\t\t\t\t\t\t\t\tMerit: 682\n\n\t\t\t\t\t\t\t\tI rather die on my feet than to live on my knees", "thread_url": "https://bitcointalk.org/index.php?topic=5568016.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "ArsenMosk", "content": "Is there any software that can generate a dictionary of passwords from the possible words that are likely to be in this password?It is necessary that the generator can take a set of words, try to change the case of each word and each letter, and also switch the layout, that is, write the desired word on a different layout. And so with each word, one at a time, some change the case and layout, others do not. And so on, in the order of all the words. As a result, the entire set of passwords was saved to a file(s) for further selection.", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 1\n\t\t\t\t\t\t\t\tMerit: 0", "thread_url": "https://bitcointalk.org/index.php?topic=5567449.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "Rapten", "content": "Okay, how do I even begin, it all started about two months ago when I came across a crypto scam wallet that is connected to a pigbutchering scam that had hundreds of thousands of transactions and I thought wow that seems odd to me there has to be some sort of vulnerability in this wallet that could help rescue these victims from. So I start poking around and it appears that some of its earliest transactions exhibit GCD bias of about 39% back when the random generator for signature was using prng before RFC 6797 was implemented there is a window of about 3000 signatures in this wallet that are all bias'd however besides reuse and several failed lattice attempts later I've hit a brick wall on attempting to break the key for the wallet to try to release all the funds from all the people this wallet has scammed. Its automated runs batched transactions produces thousands of transactions daily and appears to have fixed its initial prng state which is why anyone that pulled up all the transactions for it and tried to build a lattice for the wallet would straight up fail it's been diluted from better rng as time has gone on. For grins I started poking around a few other wallets with a similar mo thousands or hundreds of transactions per day gcd bias in their implementation initially that smooths out over time. I would really love if anyone who understands this stuff and is interested and willing to help me recover the funds for this wallet. we are talking massive money in the neighborhood of hundreds of millions of dollars in these wallets that I truly would love to set back to their original owners. Anyway if anyone understands how the python scep256 libraries changed during 2022 to around July 2022 and has the technical expertise on how to crack this sort of implementation and wants a project I'm sure it would end up with a sizable reward I'm more than willing to share all the knowledge I have on the situation and would love to get an expert opinion on how this stuff works. I set up sage math and have fpylll installed along with all the other dependencies but just honestly don't have a complete grasp how to get this past the finish line. If anyone wants to help I'm sure if we crack this anything any of the victims get back would be a win for them.", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 1\n\t\t\t\t\t\t\t\tMerit: 0", "thread_url": "https://bitcointalk.org/index.php?topic=5565390.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "kurve21", "content": "In the core version v0.18.1 there is still an error with \"decoderawtransaction\".For example, the Tx 54549260d3aa4ee5410022e209699844fb2e2b7d1059221e8c03fb5bad211533 cannot be decoded correctly. The witness field is not recognized.I know that this bug has been fixed in the latest version. My question is, in which version exactly was the bug fixed? So what is the oldest version where this bug is fixed?Anything anyone could find out it would be great! Thank you!-----------------------------------------------------------------------------------Edit:I did a little testing and figured it out for myself. In V.0.21.1 the error is no longer there.", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 9\n\t\t\t\t\t\t\t\tMerit: 7", "thread_url": "https://bitcointalk.org/index.php?topic=5567860.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "bitmover", "content": "I have been thinking about address reuse and the quantum computer problem.As far as I know, we are safe if we never expend from an address. Which becomes quite complicated if we handle dozens and dozens of addresses, and we reuse some of them (like giveaways, campaigns, and other recurring payments, etc). I know there is a privacy risk about address reuse, but that is manageable if you handle UTXO with patience. The security is what bugs me now.Until when do you guys think it is safe to keep reusing addresses like? I was thinking about creating a new wallet and sending all coins to a newly wallet, because my current wallet has like 50+ used addresses and change addresses with most of them already spent from... And I also use a Hardware wallet, which makes things a little slower to handle.How do you guys manage so much addresses? I know this is the case for many \"heavy\" bitcoin users here, like me", "date": "Legendary\n\n Online\n\t\t\t\t\t\t\t\tActivity: 2884\n\t\t\t\t\t\t\t\tMerit: 7135\n\n\t\t\t\t\t\t\t\tTrêvoid █ No KYC-AML Crypto Swaps", "thread_url": "https://bitcointalk.org/index.php?topic=5566993.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "mahurovihamilo", "content": "Hi there, I am having errors compiling for the GPU version.... appreciate any suggestions....this is my setup:ubuntu2~24.04gcc version 13.3.0 (Ubuntu 13.3.0-6ubuntu2~24.04)the SDK is not installed under /usr/local/ ...... cant find where the directory is but it sees it here:which nvcc/usr/bin/nvccnvcc: NVIDIA (R) Cuda compiler driverCopyright (c) 2005-2023 NVIDIA CorporationBuilt on Fri_Jan__6_16:45:21_PST_2023Cuda compilation tools, release 12.0, V12.0.140Build cuda_12.0.r12.0/compiler.32267302_0I am getting these errors:ryptyk@kryptyk-System:~/Kangaroo$ make gpu=8 ccap=20 allcd obj && mkdir -p GPUg++ -DWITHGPU -m64 -mssse3 -Wno-unused-result -Wno-write-strings -O2 -I. -I/usr/local/cuda/include -o obj/Timer.o -c Timer.cppIn file included from Timer.cpp:18:Timer.h:36:27: error: \u0091uint32_t\u0092 has not been declared36 | static void SleepMillis(uint32_t millis);| ^~~~~~~~Timer.h:37:10: error: \u0091uint32_t\u0092 does not name a type37 | static uint32_t getSeed32();| ^~~~~~~~Timer.h:23:1: note: \u0091uint32_t\u0092 is defined in header \u0091\u0092; did you forget to \u0091#include \u0092?22 | #include+++ |+#include23 | #ifdef WIN64Timer.h:38:10: error: \u0091uint32_t\u0092 does not name a type38 | static uint32_t getPID();| ^~~~~~~~Timer.h:38:10: note: \u0091uint32_t\u0092 is defined in header \u0091\u0092; did you forget to \u0091#include \u0092?Timer.cpp:65:1: error: \u0091uint32_t\u0092 does not name a type65 | uint32_t Timer::getSeed32() {| ^~~~~~~~Timer.cpp:34:1: note: \u0091uint32_t\u0092 is defined in header \u0091\u0092; did you forget to \u0091#include \u0092?33 | #include <string.h>+++ |+#include34 | time_t Timer::tickStart;Timer.cpp:69:1: error: \u0091uint32_t\u0092 does not name a type69 | uint32_t Timer::getPID() {| ^~~~~~~~Timer.cpp:69:1: note: \u0091uint32_t\u0092 is defined in header \u0091\u0092; did you forget to \u0091#include \u0092?Timer.cpp:183:6: error: variable or field \u0091SleepMillis\u0092 declared void183 | void Timer::SleepMillis(uint32_t millis) {| ^~~~~Timer.cpp:183:25: error: \u0091uint32_t\u0092 was not declared in this scope183 | void Timer::SleepMillis(uint32_t millis) {| ^~~~~~~~Timer.cpp:183:25: note: \u0091uint32_t\u0092 is defined in header \u0091\u0092; did you forget to \u0091#include \u0092?make: *** [Makefile:80: obj/Timer.o] Error 1Updte:I fixed the above issue (for nyone trying to do the same in newer versions) by adding:#include <cstdint>to Timer.cpp and Timer.hThe compiler ran well, but now I have and issue with the CUDA location: this is the error:make: /usr/local/cuda/bin/nvcc: No such file or directoryI know nvcc is installe, just cant find its location (as in directory)any ideas...?I fixed it !!", "date": "Jr. Member\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 48\n\t\t\t\t\t\t\t\tMerit: 2", "thread_url": "https://bitcointalk.org/index.php?topic=5562700.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "nathmaroal", "content": "Hi everyone,I\u0092m looking for any archived Bitcoin network-level datasets from around 2012, ideally containing information about transaction propagation or node activity. I\u0092ve read the early work by Dan Kaminsky and others on Bitcoin network monitoring, and I understand this is a long shot - but I figured it\u0092s worth asking here.Back in the day, Blockchain.info used to internally log the IP addresses of nodes that relayed transactions. I\u0092m wondering if any researchers, institutions, or enthusiasts from the early Bitcoin days might have collected similar data and are willing to share it - even partially or informally.If you know of: any datasets from 2012 that include network-level metadata (e.g., relay info, timestamps, node behavior), old monitoring scripts or tools used to observe the Bitcoin P2P network, academic or personal archives from early Bitcoin research \u0085 I\u0092d be very grateful for any pointers. Feel free to share this with anyone who was active in Bitcoin security or network research back then - it might just reach the right person.", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 6\n\t\t\t\t\t\t\t\tMerit: 10", "thread_url": "https://bitcointalk.org/index.php?topic=5563037.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "mahurovihamilo", "content": "Does any of  you know, in Linux, how to enumerate the GPUs? I am using this, but getting an error:./kangaroo -gpu gpuId0,gpuId1,gpuId2,gpuId3,gpuId4,gpuId5,gpuId6,gpuId7 -ws savedKangs.txt -wi 30 in.txtKangaroo v2.2Unexpected gpuId0,gpuId1,gpuId2,gpuId3,gpuId4,gpuId5,gpuId6,gpuId7 argumentThank you!", "date": "Jr. Member\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 48\n\t\t\t\t\t\t\t\tMerit: 2", "thread_url": "https://bitcointalk.org/index.php?topic=5563652.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "christine_dkim", "content": "Does anyone have context on why last Thursday's (October 23) Bitcoin Core developers meeting was skipped? I cover these meetings regularly through the BTC Before Light newsletter, and I was curious if there was any reason for the pause. Thank you!", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 6\n\t\t\t\t\t\t\t\tMerit: 5", "thread_url": "https://bitcointalk.org/index.php?topic=5563747.0", "source": "bitcointalk"}
{"forum": "bitcointalk", "board": "Development & Technical Discussion", "author": "rdenkye", "content": "Are there two different known scalars on secp256k1 that give points with the same y-coordinate?", "date": "Newbie\n\n Offline\n\t\t\t\t\t\t\t\tActivity: 12\n\t\t\t\t\t\t\t\tMerit: 1", "thread_url": "https://bitcointalk.org/index.php?topic=5558826.0", "source": "bitcointalk"}
